//=====================================================================================================================================================================
#pragma once

//指定要求的最低平台是 Windows XP。
#ifndef WINVER
#define WINVER 0x0500
#endif

//指定要求的最低平台是 Windows XP。
#ifndef _WIN32_WINNT
#define _WIN32_WINNT 0x0500
#endif

// 指定要求的最低平台是 Windows 98。
#ifndef _WIN32_WINDOWS
#define _WIN32_WINDOWS 0x0410
#endif

// 指定要求的最低平台是 Internet Explorer 6.0。
#ifndef _WIN32_IE
#define _WIN32_IE 0x0700
#endif

//=====================================================================================================================================================================
